Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན་མི་ཞིག་བྲག་ཕུག་ཏུ་ཞུགས་ཏེ། དེར་འགྲོ་བ་ན་ངོས་གཡས་གཡོན་ན་དབྱིག་དང་། གསེར་དང་། དངུལ་དག་མཐོང་སྟེ།
en: Venerable Pūrṇa, as an analogy, consider a man who goes into a cave only to discover that everywhere the walls are filled with gems, gold, and silver.

source: དེ་ཇི་ལྟ་ཇི་ལྟར་ནང་དུ་འགྲོ་བ་དེ་ལྟ་དེ་ལྟར་ངོས་གཡས་གཡོན་ན་དབྱིག་དང་། གསེར་དང་། དངུལ་གྱིས་ཡོངས་སུ་གང་བར་མཐོང་ཞིང་། མུ་ཏིག་གི་ཆུན་པོས་ཀྱང་ཡོངས་སུ་གང་བར་མཐོང་ངོ་།
en: The farther he goes into the cave, the more gems, gold, and silver he discovers and now he even notices clusters of pearls.

source: །དེ་གལ་ཏེ་དེ་ལ་ཆགས་པ་སྐྱེད་ན། དེའི་ནང་གི་རིན་པོ་ཆེ་རིན་ཐང་མེད་པ་གང་དག་ཡིན་པ་དེ་དག་ལས་དེ་ཡོངས་སུ་ཉམས་པར་འགྱུར་རོ།
en: If he should become attached to his discovery, he would miss out on the truly priceless gems in the cave.

source: །གལ་ཏེ་དེར་དབྱིག་དང་། གསེར་དང་། དངུལ་དང་། མུ་ཏིག་གི་ཆུན་པོ་དེ་དག་ལ་ཆགས་པ་མི་སྐྱེད་ན་ནི། དེ་དེ་ལས་འདས་ནས་རིན་པོ་ཆེ་རིན་ཐང་མེད་པ་རྣམས་གང་ན་ཡོད་པའི་ཕྱོགས་དེར་ཕྱིན་ནས་མཐོང་བར་འགྱུར་ཞིང་དེ་རིན་པོ་ཆེ་རིན་ཐང་མེད་པ་དེ་དག་དང་ལྡན་པར་འགྱུར་རོ།
en: If, however, he does not get attached to all the gems, gold, silver, and clusters of pearls, he could set those aside, find where the truly priceless gems are, and take possession of them.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་ཐབས་ལ་མི་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སའི་བསྔགས་པའམ། ཆོ་འཕྲུལ་ལམ། རྫུ་འཕྲུལ་བརྗོད་པ་ན་དེར་འོང་ཞིང་འདྲུལ་ལ་ཆགས་པར་བྱེད་ན་དེ་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རིན་པོ་ཆེ་ལས་ཉམས་པར་འགྱུར་རོ།
en: Venerable Pūrṇa, likewise, if bodhisattvas who are not skillful praise the levels of the hearers and solitary buddhas as well as their miraculous and supernatural abilities, they might begin to long for those states. In that case they will have been diverted away from the precious gem of omniscience.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་ཐབས་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སའི་བསྔགས་པ་བརྗོད་པ་ན་དེ་དག་ཡིད་ལ་མི་བྱེད་ཅིང་ཟིལ་གྱིས་མནན་ཏེ་འགྲོའོ།
en: Venerable Pūrṇa, when skillful bodhisattvas praise the levels of the hearers and solitary buddhas, they do so without any mental involvement and while continuing to surpass them.

source: །དེ་ལ་ཆགས་པ་ཡང་མི་སྐྱེད། ཞེན་པར་ཡང་མི་འགྱུར།
en: They do not even feel the slightest attachment to them, nor any clinging or desire for them.

source: སྲེད་པར་ཡང་མི་བྱེད་དེ་དེ་ལ་སྲེད་པར་མི་བྱེད་ཅིང་ཡིད་ལ་མི་བྱེད་པ་དེས་ནི་ཟིལ་གྱིས་མནན་ཏེ་འགྲོའོ།
en: Without any desire or concern for them, they are able to surpass them.

source: ཉན་ཐོས་ཀྱི་ས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་དང་། ས་འདི་གཉིས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་བར་ཆད་བྱེད་པ་སྟེ།
en: Because the levels of the hearers and solitary buddhas present an obstacle to attaining omniscience.

source: འདི་དག་ལས་འདས་ནས་རིམ་གྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རིན་པོ་ཆེ་འཐོབ་པར་འགྱུར་རོ།
en: It is by going beyond these two states that they can gradually attain the precious gem of omniscience. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན་མི་དེ་དབྱིག་དང་། གསེར་དང་། དངུལ་དང་། མུ་ཏིག་གི་ཆུན་པོ་རྣམས་ལས་འདས་ཏེ། དེ་དག་ལ་ཆགས་པ་མི་སྐྱེད་པར་ནང་དུ་ཞུགས་ནས་རིན་པོ་ཆེ་རིན་ཐང་མེད་པ་དེ་དག་དང་ལྡན་པར་གྱུར་ན་བདག་ཉིད་ཀྱང་སྤྱོད་ལ།
en: Venerable Pūrṇa, if that man is able to rise above his attachment to the gems, gold, silver, and clusters of pearls, he can stay in the cave and enjoy the truly priceless valuables that he now possesses.

source: སེམས་ཅན་རྣམས་ལ་ཡང་ཡང་དག་པར་འགོད་པའི་ངང་ཚུལ་ཅན་དུ་འགྱུར་རོ།
en: In fact, he can even share them all with others.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་ལ་མཁས་པ་ཡང་ས་འདི་གཉིས་ལ་རོ་མི་མྱང་བར་འདས་ནས་རིམ་གྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རིན་པོ་ཆེ་དང་ལྡན་པར་འགྱུར་རོ།
en: Venerable Pūrṇa, likewise, skillful bodhisattva great beings do not savor their experiences and thus they are able to rise above these two levels and gradually attain the state of omniscience.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེ་གཉིས་ལ་རབ་ཏུ་ཆགས་ན། དེ་ནི་ཐབས་ལ་མི་མཁས་པར་རིག་པར་བྱའོ།
en: However, if bodhisattva great beings should become attached to those two levels, they would no longer possess skillful means.

source: །དེ་བས་ན་ཐབས་ལ་མཁས་པས་ཡོངས་སུ་ཟིན་པས་དེ་ལ་ཡིད་བརྟན་པར་མི་བྱ་སྟེ།
en: Therefore, it is due to embracing skillful means that they do not place any trust in those two levels.

source: ཇི་སྲིད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་པ་དེ་སྲིད་དུ་བྱང་ཆུབ་སེམས་དཔས་ཡིད་བརྟན་པར་མི་བྱའོ།
en: As long as they have not awakened to unsurpassed and perfect buddhahood, bodhisattvas do not place their trust elsewhere.”

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡིད་མི་བརྟན་པར་མི་བྱ་བ་གང་ཡིན།
en: Venerable Pūrṇa asked, “Venerable Śāradvatīputra, what does it mean that nonregressing bodhisattva great beings do not place their trust elsewhere?”

source: སྨྲས་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་ནི་ཡིད་མི་བརྟན་པར་མི་བྱའོ།
en: Venerable Śāradvatīputra said, “It is not that they should distrust the six perfections.

source: །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་འདྲིས་པར་སྤྱོད་པ་ནི་རིང་པོ་མི་ཐོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: It is by becoming familiar with the six perfections that they soon shall awaken to unsurpassed and perfect buddhahood.

source: དེས་འདི་ལྟར་བདག་ཡུན་རིང་མོ་ཞིག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་དུ་འོང་གིས་བདག་གིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་མགོ་དང་གོས་ལ་མེ་འབར་བ་བཞིན་དུ་སྤྱད་པར་བྱའོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱའོ།
en: Therefore, bodhisattvas think, ‘I will engage in the six perfections with the same urgency as if my hair and clothes were on fire, so that I can awaken to unsurpassed and perfect buddhahood in a short span of time.’

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་དེ་བདག་ཚུལ་ཁྲིམས་འདིས་མཚན་རྣམས་ཡོངས་སུ་འཛིན་པར་གྱུར་ཅིག་ཅེས་ཀུན་ཏུ་སྤྱོད་པ་
en: Moreover, Venerable Pūrṇa, bodhisattvas who wish to awaken to unsurpassed and perfect buddhahood might get the thought, ‘May this discipline of mine enable me to possess all the marks of a buddha!’

source: འདི་ལྟ་བུ་དག་འབྱུང་བར་གྱུར་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་རྣམ་པར་རྟོག་པ་ལ་ཞུགས་པ་ཡིན་ནོ།
en: If that happens, it means that the bodhisattvas are engaged in thinking.

source: །རྣམ་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེའི་འཆལ་པའི་ཚུལ་ཁྲིམས་ཡིན་པར་རིག་པར་བྱ་སྟེ།
en: And any type of thinking should be acknowledged as a fault in the bodhisattvas’ discipline.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི་མཚན་རྣམས་ཀྱི་ཆེད་དུ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་འཇུག་པར་མི་བྱའོ།
en: It is therefore not appropriate for bodhisattva great beings to strive for unsurpassed and perfect awakening simply for the sake of attaining these marks.

source: །གལ་ཏེ་མཚན་རྣམས་ལ་མཆོག་ཏུ་འཛིན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་མཆོག་ཏུ་འཛིན་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: If bodhisattvas think of the marks as being supreme, it means that they cling excessively to discipline.”

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ལེའུ་ལྔ་པའོ།། །།
en: This is the fifth chapter from “The Perfection of Discipline.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ཁྱོད་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ནི་ཚུལ་ཁྲིམས་མཆོག་ཏུ་འཛིན་པའོ། །འདི་ནི་ཚུལ་ཁྲིམས་མཆོག་ཏུ་འཛིན་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཤེས་པ་ཡོད་དམ་གསོལ་པ།
en: Then the Blessed One said to Venerable Śāradvatīputra, “Śāradvatīputra, do you understand what it means to say, ‘This bodhisattva clings excessively to discipline while this one does not?’ ”

source: བདག་ཇི་ལྟར་བཅོམ་ལྡན་འདས་ལ་གློ་བ་ཆེས་ཤིང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་འཚལ་བ་ལྟར་ན་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་སེམས་བསྐྱེད་ན་ཚུལ་ཁྲིམས་མཆོག་ཏུ་འཛིན་པར་རིག་པར་བགྱིའོ།
en: Śāradvatīputra replied, “As I have understood the meaning expressed by the Blessed One, in whom I trust, bodhisattvas should be known as clinging excessively to discipline if they develop aspirations for the levels of the hearers or the solitary buddhas.

source: འདི་ལྟར་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་སེམས་བསྐྱེད་ན་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་མ་ལགས་ཏེ།
en: Because if they aspire to attain the levels of the hearers or the solitary buddhas, then they are no longer within the domain of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་མཆོག་ཏུ་འཛིན་པ་ལགས་པར་རིག་པར་བགྱིའོ།
en: Instead, those bodhisattvas are excessively clinging to discipline.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་གཟུགས་ལ་དམིགས་པའམ། སྒྲ་ལ་དམིགས་པའམ། དྲི་ལ་དམིགས་པའམ། རོ་ལ་དམིགས་པའམ། རེག་པ་ལ་དམིགས་པའི་སེམས་བསྐྱེད་ན་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བགྱིད་པ་ལགས་པར་རིག་པར་བགྱིའོ།
en: If bodhisattvas focus on form, sound, smell, taste, or texture, that should be considered unfounded attention by bodhisattvas.

source: འདི་ལྟར་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བགྱིད་པ་དེ་ནི་ཉོན་མོངས་པའི་གྲངས་སུ་གཏོགས་ལ། ཉོན་མོངས་པའི་གྲངས་སུ་གཏོགས་པ་དེ་ནི་སྐྱེ་བ་དེ་དང་དེ་དག་ཏུ་ལུས་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: Because such unfounded attention is classified as a disturbing emotion and all that belongs under that category that leads to taking on a physical body in this and other lives.

source: །ཇི་ལྟ་ཇི་ལྟར་ལུས་ཡོངས་སུ་འཛིན་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡང་དག་པར་བླངས་ཏེ་གནས་པར་འགྱུར་རོ།
en: However, the more they take on physical bodies, the more they can practice and engage in the six perfections.

source: །ཇི་ལྟ་ཇི་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡང་དག་པར་བླངས་ཏེ་གནས་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བར་འགྱུར་རོ།
en: The more they are able to practice and engage in the six perfections, the closer they come to omniscience.

source: །བཅོམ་ལྡན་འདས་བདག་ནི་འདི་ལ་འདི་ལྟར་འཚལ་ཏེ།
en: Blessed One, that is how I understand it.

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ཉོན་མོངས་པ་རྣམས་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཕན་འདོགས་པ་ལགས་ཏེ།
en: Blessed One, in this way even disturbing emotions can be of benefit for bodhisattva great beings in their pursuit of omniscience.

source: བཅོམ་ལྡན་འདས་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཉོན་མོངས་པ་རྣམས་ཀྱང་ཕན་འདོགས་པར་གྱུར་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཐབས་ལ་མཁས་པ་ལགས་པར་རིག་པར་བགྱིའོ།
en: Thus, Blessed One, whenever bodhisattvas see that even disturbing emotions can be of benefit, that is when those bodhisattva great beings become truly skilled in means.

source: །དེ་ལྟར་ན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ལ་གནས་པ་ལགས་ཏེ། དེ་ལྟར་ན་ཚུལ་ཁྲིམས་མཆོག་ཏུ་འཛིན་པ་མ་ལགས་པར་རིག་པར་བགྱིའོ།
en: Moreover, in this way bodhisattvas also observe discipline and do not excessively cling to it.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Blessed One said to Venerable Śāradvatīputra, “Excellent!

source: ཤ་ར་དྭ་ཏིའི་བུ་ལེགས་སོ་ལེགས་སོ།
en: Śāradvatīputra, that is excellent!

source: །ཤ་ར་དྭ་ཏིའི་བུ་ཁྱོད་དེ་ལྟར་སྟོན་པ་ནི་དེ་བཞིན་གཤེགས་པས་གསུངས་པ་སྨྲ་བ་དང་།
en: Śāradvatīputra, what you have just said is precisely what the Thus-Gone One has taught.

source: ཆོས་སྨྲ་བ་ཡིན་ཏེ། ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་ཀྱང་ལན་འདེབས་པ་ཡིན་ནོ།
en: It is a true Dharma statement and a reply that fully conforms with the Dharma.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པས་འདི་ལྟར་བདག་གི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིས་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་གི་སེམས་ཅན་ཚུལ་ཁྲིམས་འཆལ་པ་གང་དག་ཡིན་པ་དེ་དག་བདག་གི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ཚུལ་ཁྲིམས་སོ་སོར་ཐོབ་པར་གྱུར་ཅིག །འཆལ་པའི་ཚུལ་ཁྲིམས་རྣམ་པར་སྤོང་བར་གྱུར་ཅིག །
en: Śāradvatīputra, in this regard, when bodhisattva great beings observe the perfection of discipline, they will form the wish, ‘By this practice of the perfection of discipline, may all beings in all the endless and limitless worlds who practice a lapse in discipline, each attain proper discipline as a result of my training in the perfection of discipline!

source: བདག་གི་ཚུལ་ཁྲིམས་འདིས་སེམས་ཅན་དེ་དག་ལ་ཕན་ཡང་གདགས་པར་བྱའོ་སྙམ་དུ་རིག་པར་བྱེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཐབས་ལ་མཁས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: May they abandon their lapse in discipline and may this discipline of mine be of benefit to everyone!’ If bodhisattvas think in this way, they should be regarded as being skilled in means.

source: །དེ་ཇི་ལྟ་ཇི་ལྟར་ཚུལ་ཁྲིམས་ཡོངས་སུ་སྔོ་བར་བྱེད་པ་དེ་ལྟ་དེ་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་འཕེལ་བར་འགྱུར་རོ།
en: The more they are able to dedicate their discipline, the more their perfection of discipline will flourish.

source: །ཇི་ལྟ་ཇི་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་འཕེལ་བ་དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: The more their perfection of discipline flourishes, the more those bodhisattvas come to uphold the boundless Dharma.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཚད་ངེས་པར་མ་བཅས་པས་ཆོས་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: By not limiting their discipline, bodhisattvas come to uphold the boundless Dharma.

source: །འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་པའི་སེམས་ཅན་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པ་གང་དག་ཡིན་པ་དེ་དག་ཀྱང་བདག་གི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཅིག །ཕྱིར་མི་ལྡོག་པ་གང་དག་ཡིན་པ་དེ་དག་ཀྱང་མྱུར་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག་ཅེས་བྱང་ཆུབ་སེམས་དཔའ་ལ་དམིགས་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཡོངས་སུ་སྔོ་བར་བྱེད་དོ།
en: Moreover, bodhisattvas should dedicate their merit by focusing on other bodhisattvas, saying, ‘May all beings in all the limitless worlds who have newly entered the bodhisattva vehicle become nonregressing by means of my discipline, and may all nonregressing bodhisattvas quickly perfect the state of omniscience!’

source: །ཇི་ལྟ་ཇི་ལྟར་ཡོངས་སུ་སྔོ་བར་བྱེད་པ་དེ་ལྟ་དེ་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་མི་སྤོང་ཞིང་དེ་ལྟ་དེ་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བར་འགྱུར་ཏེ།
en: The more bodhisattvas are able to dedicate merit in this way, the more they avoid straying from the mind of omniscience and the closer they are to that state.

source: བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དཔག་ཏུ་མེད་པ་ནི་ཆེས་དཔག་ཏུ་མེད་པར་འགྱུར་རོ།
en: In this way those bodhisattvas’ boundless perfection of discipline will increase endlessly. “

source: །བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་ལ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་སྔོ་བ་གང་ཡིན་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན་སེམས་ཅན་ཚུལ་ཁྲིམས་འཆལ་པ་གང་དག་ཡོད་པ་དེ་དག་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག་ཅེས་ཡོངས་སུ་སྔོ་ན་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་ལ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་སྔོ་བ་གང་ཡིན་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་སྔོ་བ་དེ་ལ་ཡོངས་སུ་སྔོ་བ་སྔ་མས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: The dedication made by bodhisattvas who dedicate the perfection of discipline to other bodhisattvas can be compared with the dedication of someone who makes the wish, ‘May all the lapse in discipline of beings in as many worlds as there are grains of sand in the Ganges be consummated as the perfection of discipline!’ In that case, the latter dedication does not amount even to one percent of the dedication of the perfection of discipline made by the bodhisattvas who dedicate their perfection of discipline toward other bodhisattvas.

source: །སྟོང་གི་ཆ་དང་། འབུམ་གྱི་ཆ་དང་། གྲངས་དང་། ཆ་དང་། བགྲང་བ་དང་། དཔེ་དང་། རྒྱུར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: Nor does it count for one thousandth or a hundred thousandth of that. In fact, no number, fraction, enumeration, analogy, or comparison would suffice.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་བཟུང་བ་ཡིན་ཞིང་ཉེ་བར་བརྟན་པ་ཡིན་པའི་ཕྱིར་རོ།
en: Because, Śāradvatīputra, those bodhisattvas embrace and support the state of omniscience.

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣལ་འབྱོར་ཡོངས་སུ་འཛིན་ཅིང་ཉེ་བར་སྟོན་པ་དེས་ནི་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་རྣམས་ལ་ཕན་གདགས་ཤིང་ཉེ་བར་བརྟན་པར་འགྱུར་རོ།
en: Any bodhisattvas who uphold the practice of omniscience and teach it to others will benefit and support countless and limitless beings. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན། ཀ་བ་གཅིག་པའི་ཁང་བཟངས་ཤིག་ལ་འདུག་ས་བཅུའམ། ཉི་ཤུ་ཡོད་ལ།
en: Śāradvatīputra, imagine a mansion with ten or twenty halls, supported by just a single pillar.

source: ཁང་བཟངས་དེའི་ནང་ནི་གྲིབ་མ་ལ་སྲོག་ཆགས་བརྒྱ་ཕྲག་མང་པོ་རྣམས་དང་། སྲོག་ཆགས་སྟོང་ཕྲག་མང་པོ་རྣམས་དང་། སྲོག་ཆགས་འབུམ་ཕྲག་མང་པོ་དག་འདུས་པར་གྱུར་ལ།
en: In the shade inside that mansion there might be several hundred, several thousand, or even several hundred thousand beings.

source: མི་ལ་ལ་ཞིག་ཁང་བཟངས་ཀྱི་ཀ་བ་དེ་གཅོད་པར་འདོད་ལ་དེ་ལ་མི་ལ་ལ་ཞིག་འདི་སྐད་དུ།
en: If for some reason a man wanted to tear down that single pillar, someone might warn him, saying,

source: ཀྱེ་སྐྱེས་བུ་ཁང་བཟངས་ཀྱི་ཀ་བ་འདི་བཅད་ན་སྲོག་ཆགས་བརྒྱ་ཕྲག་མང་པོ་སྲོག་དང་བྲལ་བར་འགྱུར་རོ། །ཞེས་སྨྲ་ལ་དེ་ལ་དོན་འདོད་ཅིང་གྲུབ་པ་དང་།
en: ‘Hey! If you tear down the pillar that supports the mansion, many hundreds of beings will lose their lives.’

source: བདེ་བར་འདོད་པའི་མི་དེས་ཁང་བཟངས་ཀྱི་ཀ་བ་གཅོད་པའི་མི་དེ་བཀག་ལ་དེ་ལ་ཡང་མི་ལ་ལ་ཞིག་འདི་སྐད་དུ་ཀྱེ་མི་ཁྱོད་ཀྱིས་སྲོག་ཆགས་མང་པོ་སྲོག་ཆགས་བརྒྱ་ཕྲག་མང་པོ། སྲོག་ཆགས་སྟོང་ཕྲག་མང་པོ། སྲོག་ཆགས་འབུམ་ཕྲག་མང་པོ་རྣམས་ཀྱི་སྲོག་བྱིན་ནོ་ཞེས་ཟེར་བ་དེ་བཞིན་དུ།
en: Since such a well-meaning and caring person would be able to stop the other person from tearing down the pillar of the mansion, others might begin to praise him, saying, ‘Hey, you have given the gift of life to many hundreds, thousands, even hundreds of thousands of beings!’ “

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་འདོམས་པར་མི་བྱེད། རྗེས་སུ་སྟོན་པར་མི་བྱེད་པར་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་འདོམས་ཤིང་རྗེས་སུ་སྟོན་ན་དེས་སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་ཆད་བྱས་པ་ཡིན་ནོ།
en: Likewise, Śāradvatīputra, if bodhisattvas, who wish to awaken to unsurpassed and perfect buddhahood, teach and explain the levels of the hearers and solitary buddhas yet do not teach and explain the six perfections, then they create obstacles to attaining the state of a worthy one for a limitless number of beings.

source: །ཤ་ར་དྭ་ཏིའི་བུ་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་ཏེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཉེ་བར་སྟོན་པར་བྱེད་པ་དེས་ནི་སེམས་ཅན་རྣམས་ལ་དགྲ་བཅོམ་པ་ཉིད་བྱིན་པ་ཡིན་ནོ།
en: Śāradvatīputra, if someone teaches and explains the six perfections as well as the way to omniscience out of a wish to awaken to unsurpassed and perfect buddhahood, then they are granting beings the gift of becoming a worthy one.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་གང་ངའི་བསྟན་པ་མཐོང་ནས་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་པ་དེ་ནི་སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ལ་ཕན་པ་དང་བདེ་བའི་ཕྱིར་ཞུགས་པ་ཡིན་ནོ།
en: Therefore, Śāradvatīputra, if bodhisattvas encounter my teaching, form the wish to awaken to unsurpassed and perfect buddhahood, and subsequently teach and explain the six perfections to others, then they are bringing benefit and happiness to limitless beings. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ནི་འདི་སྙམ་དུ་ཚུལ་ཁྲིམས་འདིས་སེམས་ཅན་ཐམས་ཅད་ཚུལ་ཁྲིམས་དང་ལྡན་པར་གྱུར་ཅིག་སྙམ་དུ་སེམས་ཏེ། དེ་ལྟར་ཡོངས་སུ་སྔོ་ཞིང་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་པར་གྱུར་ལ།
en: Śāradvatīputra, other bodhisattva great beings who practice the perfection of discipline may dedicate their merit toward all beings, saying, ‘May this discipline cause all beings to observe discipline!’

source: སེམས་ཅན་གང་བདེ་བའམ་དགའ་བ་ཡང་སྐྱེ་ཞིང་སྒྲ་དེ་ཐོས་ནས་སེམས་ཅན་དེ་དག་གི་སེམས་གནོད་སེམས་མེད་ཅིང་ཚུལ་ཁྲིམས་ཀྱི་གྲངས་སུ་འགྲོ་བ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གནས་པའི་སེམས་གཅིག་བསྐྱེད་པ་ལ།
en: When others hear those words, they will be happy and joyful, and being free of ill will, they will instead adopt discipline. In that way they engender a single attitude of resting in the bodhisattvas’ perfection of discipline.

source: སྔ་མའི་བསོད་ནམས་ཀྱི་རྒྱུན་དེས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: However, that does not amount even to one percent of the stream of merit of the former bodhisattvas.

source: །སྟོང་གི་ཆ་དང་། འབུམ་གྱི་ཆ་དང་།
en: Nor does it count for a thousandth or a hundred thousandth of that.

source: །ཇི་ལྟ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཆེད་དུ་ཚུལ་ཁྲིམས་ཡོངས་སུ་སྔོ་བ་དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་འབོགས་ཏེ།
en: The more bodhisattvas dedicate their discipline for the sake of all beings, the more those bodhisattva great beings are advanced by the perfection of discipline.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ཡིན་ནོ།
en: That is why bodhisattvas should practice the perfection of discipline.”

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ལེའུ་དྲུག་པའོ།། །།
en: This is the sixth chapter from “The Perfection of Discipline.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔར་རིག་པར་བགྱི་བ་གང་ལགས།
en: Venerable Śāradvatīputra said to the Blessed One, “Blessed One, how can we identify bodhisattvas?

source: བྱང་ཆུབ་སེམས་དཔས་ཇི་སྲིད་ཀྱི་བར་དུ་སྤྱད་ན་དེ་བྱང་ཆུབ་སེམས་དཔར་རིག་པར་བགྱི།
en: How long must bodhisattvas practice in order to be known as bodhisattvas?

source: གང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སེམས་ཅན་རྣམས་འདོམས་ཤིང་རྗེས་སུ་སྟོན་ཏེ།
en: Say they explain and teach to all beings about the perfection of generosity, the perfection of discipline, the perfection of patience, the perfection of diligence, the perfection of concentration, and the perfection of insight.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དག་སེམས་ཅན་རྣམས་ཀྱི་ཕྱིར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ཞིང་།
en: Starting with the perfection of generosity, all the way through to the perfection of insight, they dedicate toward omniscience for the sake of all beings.

source: ཚིག་འདི་སྐད་དུ། བདག་གི་སྦྱིན་པ་འདིས་སེམས་ཅན་སེར་སྣ་ཅན་རྣམས་གཏོང་བ་ཐོབ་པར་གྱུར་ཅིག །
en: In the proper sequence, they dedicate by saying, ‘Through my generosity may all miserly beings become generous.

source: བདག་གི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིས་སེམས་ཅན་ཚུལ་ཁྲིམས་འཆལ་པ་རྣམས་ཚུལ་ཁྲིམས་ཐོབ་པར་གྱུར་ཅིག །
en: Through my perfection of discipline may everyone with a lapse in discipline become disciplined.

source: བདག་གི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིས་སེམས་ཅན་གནོད་སེམས་ཀྱི་སེམས་དང་ལྡན་པ་དང་། ཁྲོ་བའི་སེམས་དང་ལྡན་པ་རྣམས་བཟོད་པ་ཐོབ་པར་གྱུར་ཅིག །
en: Through my perfection of patience may all malicious and furious beings develop patience.

source: བདག་གི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིས་སེམས་ཅན་ལེ་ལོ་ཅན་རྣམས་བརྩོན་འགྲུས་ཐོབ་པར་གྱུར་ཅིག །
en: Through my perfection of diligence may all lazy beings become diligent.

source: བདག་གི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིས་སེམས་ཅན་རྣམ་པར་རྟོག་པ་སྤྱོད་པ་རྣམས་དང་། སེམས་ཅན་རྣམ་པར་གཡེངས་པ་རྣམས་བསམ་གཏན་ཐོབ་པར་གྱུར་ཅིག །
en: Through my perfection of concentration may all beings who are lost in thought and those who are distracted attain concentration.

source: བདག་གི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིས་སེམས་ཅན་ཤེས་རབ་འཆལ་པ་རྣམས་དང་།
en: Through my perfection of insight may all deluded beings with faulty insight gain proper insight!’

source: རྨོངས་པ་རྣམས་ཤེས་རབ་ཐོབ་པར་གྱུར་ཅིག་ཅེས་ཟེར་ཞིང་ས་ནས་ས་ཇི་ལྟ་བ་བཞིན་དུ་དེ་ལྟར་ཡོངས་སུ་སྔོ་ན་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བསྐལ་པ་དུས་འབྱུང་བར་རིག་པར་བགྱི་ལགས།
en: Blessed One, how many eons will it take for those bodhisattva great beings to reach their goal?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་ཡོངས་སུ་སྔོ་བ་དེ་ནི་བསྐལ་པ་ལྔ་བརྒྱས་འབྱུང་བར་རིག་པར་བྱའོ།
en: The Blessed One said to Venerable Śāradvatīputra, “Śāradvatīputra, when bodhisattva great beings dedicate in this way, they will realize their goal within five hundred eons.
